---
created: 2023-08-18T07:26:03 (UTC -04:00)
tags: []
source: https://itexamanswers.net/2-3-7-packet-tracer-navigate-the-ios-instruction-answers.html
author: IT Administrator
---

# 2.3.7 Packet Tracer - Navigate the IOS (Instruction Answers)

> ## Excerpt
> 2.3.7 Packet Tracer - Navigating the IOS (Instructor Version – Optional Packet Tracer)Instructor Note: Red fon

---
## 2.3.7 Packet Tracer – Navigating the IOS (Instructor Version – Optional Packet Tracer)

**Instructor Note:** Red font color or green highlights indicate text that appears in the instructor copy only.

### Topology

![2.3.7 Packet Tracer - Navigate the IOS](https://itexamanswers.net/wp-content/uploads/2016/10/2.3.7-Packet-Tracer-Navigate-the-IOS.jpg?ezimgfmt=ng%3Awebp%2Fngcb2%2Frs%3Adevice%2Frscb2-1)

2.3.7 Packet Tracer – Navigate the IOS

### Objectives

-   ****Part 1: Basic Connections, Accessing the CLI and Exploring Help****
-   ****Part 2: Exploring EXEC Modes****
-   ****Part 3: Setting the Clock****

### Background / Scenario

In this activity, you will practice skills necessary for navigating the Cisco IOS, including different user access modes, various configuration modes, and common commands you use on a regular basis. You also practice accessing the context-sensitive Help by configuring the `clock` command.@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-medrectangle-3-0-asloaded{max-width:580px!important;max-height:400px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[580,400\],'itexamanswers\_net-medrectangle-3','ezslot\_4',167,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-medrectangle-3-0');

#### Instructions

### Part 1: Basic Connections, Accessing the CLI and Exploring Help

#### Step 1: Connect PC1 to S1 uses a console cable.

-   a. Click the **Connections** icon (the one that looks like a lightning bolt) in the lower left corner of the Packet Tracer window.
-   b. Select the light blue Console cable by clicking it. The mouse pointer will change to what appears to be a connector with a cable dangling off of it.
-   c. Click **PC1**. A window displays an option for an RS-232 connection.
-   d. Drag the other end of the console connection to the S1 switch and click the switch to bring up the connection list.
-   e. Select the **Console** port to complete the connection.

### Instructions:

###### 1:

![2016-10-04_111619](https://itexamanswers.net/wp-content/uploads/2016/10/2016-10-04_111619.jpg?ezimgfmt=rs:734x679/rscb2/ng:webp/ngcb2)

###### 2:

![2016-10-04_112233](https://itexamanswers.net/wp-content/uploads/2016/10/2016-10-04_112233.jpg?ezimgfmt=rs:734x680/rscb2/ng:webp/ngcb2)

###### 3:

![2016-10-04_112317](https://itexamanswers.net/wp-content/uploads/2016/10/2016-10-04_112317.jpg?ezimgfmt=rs:734x680/rscb2/ng:webp/ngcb2)

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-medrectangle-4-0-asloaded{max-width:300px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[300,250\],'itexamanswers\_net-medrectangle-4','ezslot\_18',111,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-medrectangle-4-0');

#### Step 2: Establish a terminal session with S1.

a. Click **PC1** and then select the **Desktop** tab.

b. Click the **Terminal** application icon; verify that the Port Configuration default settings are correct.

What is the setting for bits per second?  

> 9600

  
c. Click **OK**.

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-box-4-0-asloaded{max-width:300px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[300,250\],'itexamanswers\_net-box-4','ezslot\_15',112,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-box-4-0');

d. The screen that appears may have several messages displayed. Somewhere on the display there should be a `Press RETURN to get started!` message. Press **ENTER**.

What is the prompt displayed on the screen?  

> S1>

#### Step 3: Explore the IOS Help.

a. The IOS can provide help for commands depending on the level being accessed. The prompt currently being displayed is called **User EXEC** and the device is waiting for a command. The most basic form of help is to type a question mark (?) at the prompt to display a list of commands.

```
S1> ?
```

Which command begins with the letter ‘C’?  

> connect

  
b. At the prompt, type t, followed by a question mark (?).

```
S1> t?
```

Which commands are displayed?  

> telnet terminal traceroute

  
c. At the prompt, type `te`, followed by a question mark (?).

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-large-leaderboard-2-0-asloaded{max-width:728px!important;max-height:90px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[728,90\],'itexamanswers\_net-large-leaderboard-2','ezslot\_6',114,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-large-leaderboard-2-0');

```
S1> te?
```

Which commands are displayed?  

> telnet terminal

  
This type of help is known as context-sensitive Help, providing more information as the commands are expanded.

### Part 2: Exploring EXEC Modes

In Part 2 of this activity, you switch to privileged EXEC mode and issue additional commands.

#### Step 1: Enter privileged EXEC mode.

a. At the prompt, type the question mark (?).

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-leader-1-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-leader-1','ezslot\_10',115,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-leader-1-0');

```
S1> ?
```

What information is displayed that describes the `enable` command?  

> Turn on privileged commands

  
b. Type **en** and press the **Tab** key.

```
S1> en
```

What displays after pressing the Tab key?  

> enable

  
This is called command completion or tab completion. When part of a command is typed, the **Tab** key can be used to complete the partial command. If the characters typed are enough to make the command unique, as in the case with the `enable` command, the remaining portion is displayed.

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-large-mobile-banner-1-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-large-mobile-banner-1','ezslot\_3',116,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-large-mobile-banner-1-0');

What would happen if you were to type **te** and press **Tab** at the prompt?  

> There is more than one command that begins with the letters ‘te’ because ‘te’ does not provide enough characters to make the command unique. The characters will continue to display, prompting the user for additional characters to make the command unique.

  
c. Enter the `enable` command and press **ENTER**.  
How does the prompt change?  

> It changes from S1> to S1#, which indicates privileged EXEC mode.

  
d. When prompted, type the question mark (?).

```
S1# ?
```

One command starts with the letter ‘C’ in user EXEC mode.

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-leader-2-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-leader-2','ezslot\_11',117,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-leader-2-0');

How many commands are displayed now that privileged EXEC mode is active? (**Hint:** you could type c? to list just the commands beginning with ‘C’.)  

> 5 – clear, clock, configure, connect, and copy

#### Step 2: Enter Global Configuration mode

a. When in privileged EXEC mode, one of the commands starting with the letter ‘C’ is **configure**. Type either the full command or enough of the command to make it unique. Press the **Tab** key to issue the command and press ENTER.

```
S1# configure
```

What is the message that is displayed?  

C> onfiguring from terminal, memory, or network \[terminal\]?

  
b. Press Enter to accept the default parameter that is enclosed in brackets **\[terminal\]**.  
How does the prompt change?

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-leader-4-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-leader-4','ezslot\_14',118,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-leader-4-0');

```
S1(config)#
```

c. This is called global configuration mode. This mode will be explored further in upcoming activities and labs. For now exit back to Privileged EXEC mode by typing end, exit or Ctrl-Z.

```
S1(config)# exit
S1#
```

### Part 3: Setting the Clock

#### Step 1: Use the clock command.

a. Use the `clock` command to further explore Help and command syntax. Type `show clock` at the privileged EXEC prompt.

```
S1# show clock
```

What information is displayed? What is the year that is displayed?  

> UTC Mon Mar 1 1993 preceded by the hours, minutes, and seconds since the device started. The year is 1993.

b. Use the context-sensitive Help and the `clock` command to set the time on the switch to the current time. Enter the command `clock` and press ENTER.

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-mobile-leaderboard-2-0-asloaded{max-width:728px!important;max-height:90px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[728,90\],'itexamanswers\_net-mobile-leaderboard-2','ezslot\_17',119,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-mobile-leaderboard-2-0');

```
S1# clock
```

What information is displayed?  

> % Incomplete command

  
c. The % Incomplete command message is returned by the IOS indicating that the `clock` command needs further parameters. Any time more information is needed help can be provided by typing a space after the command and the question mark (?).

```
S1# clock ?
```

What information is displayed?  

> set Set the time and date

  
d. Set the clock using the `clock set` command. Proceed through the command one step at a time.

```
S1# clock set ?
```

What information is being requested?  

> hh:mm:ss Current Time

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-mobile-leaderboard-1-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-mobile-leaderboard-1','ezslot\_16',120,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-mobile-leaderboard-1-0');

  
What would have been displayed if only the `clock set` command had been entered, and no request for help was made by using the question mark?  

> % Incomplete command

  
e. Based on the information requested by issuing the **clock set ?** command, enter a time of 3:00 p.m. by using the 24-hour format of 15:00:00. Check to see if further parameters are needed.

```
S1# clock set 15:00:00 ?
```

The output returns the request for more information:

```
<1-31>  Day of the month 
MONTH   Month of the year
```

f. Attempt to set the date to 01/31/2035 using the format requested. It may be necessary to request additional help using the context-sensitive Help to complete the process. When finished, issue the `show clock` command to display the clock setting. The resulting command output should display as:

```
S1# show clock
*15:0:4.869 UTC Tue Jan 31 2035
```

g. If you were not successful, try the following command to obtain the output above:

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-leader-3-0-asloaded{max-width:250px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[250,250\],'itexamanswers\_net-leader-3','ezslot\_13',121,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-leader-3-0');

```
S1# clock set 15:00:00 31 Jan 2035
```

#### Step 2: Explore additional command messages.

a. The IOS provides various outputs for incorrect or incomplete commands as experienced in earlier sections. Continue to use the `clock` command to explore additional messages that may be encountered as you learn to use the IOS.

b. Issue the following command and record the messages:

```
S1# cl (tab)
```

What information was returned?  

> % Ambiguous command: “cl”

```
S1# clock
```

What information was returned?  

> % Incomplete command.

@media(min-width:0px){#div-gpt-ad-itexamanswers\_net-large-mobile-banner-2-0-asloaded{max-width:300px!important;max-height:250px!important}}if(typeof ez\_ad\_units!='undefined'){ez\_ad\_units.push(\[\[300,250\],'itexamanswers\_net-large-mobile-banner-2','ezslot\_7',122,'0','0'\])};\_\_ez\_fad\_position('div-gpt-ad-itexamanswers\_net-large-mobile-banner-2-0');

```
S1# clock set 25:00:00
```

What information was returned?

> ```
> S1#clock set 25:00:00
>              ^
> % Invalid input detected at '^' marker.
> S1# clock set 15:00:00 32
> ```

What information was returned?

> ```
> S1#clock set 15:00:00 32
>                       ^
> % Invalid input detected at '^' marker.
> ```
